# Данные для позитивных проверок валидации полей

# Данные для полей Имя и Фамилия

ALLNAME_FLD_LEN_POSSITIVE = (
                        [
                            {'INPUT': 'ива'},
                            {'INPUT': 'ив'},
                            {'INPUT': 'ИвановскийИвановскийИвановскийИвановскийИвановски'},
                            {'INPUT': 'ИвановскийИвановскийИвановскийИвановскийИвановский'}
                        ],
                        [
                            '3 letters',
                            '2 letters',
                            '49 letters',
                            '50 letters',
                        ]
                       )
ALLNAME_FLD_SYMB_POSSITIVE = (
                        [
                            {'INPUT': 'Иванов'},
                            {'INPUT': 'Ivanov'},
                            {'INPUT': 'Иванов-Петров'},
                            {'INPUT': 'Ivanov-petrov'},
                            {'INPUT': 'Иванов Петров'},
                            {'INPUT': 'Ivanov Petrov'}],
                        [
                            'russian symbols',
                            'eng symbols',
                            'russian symbol and -',
                            'eng symbols and -',
                            'russian symbol and space',
                            'eng symbols and space'
                         ]
                        )
ALLNAME_FLD_SPACE_DELETE = (
                        [
                            {'INPUT': '  Иванов'},
                            {'INPUT': 'Иванов  '}
                        ],
                        [
                            'with left space',
                            'with right space'
                         ],
                        )

ALLNAME_FLD_TEXT_REGISTR = (
                        [
                            {'INPUT': 'ИвAнOв'}
                        ],
                        [
                            'wright text registr field save'
                         ],
                        )

# Данные для поля Дата рождения
DBIRTH_FLD_POSSITIVE = (
                        [
                            {'INPUT': '26/02/1981'},
                            {'INPUT': '30/01/1985'},
                            {'INPUT': '28/02/1981'},
                            {'INPUT': '31/03/1981'},
                            {'INPUT': '30/06/1981'},
                            {'INPUT': '31/08/1999'},
                            {'INPUT': '30/11/1977'}
                        ],
                        [
                            'Valid date of birth',
                            'Last valid day in january',
                            'Last valid day in fabruary',
                            'Last valid day in march',
                            'Last valid day in june',
                            'Last valid day in august',
                            'Last valid day in november',
                         ]
                        )

# Данные для поля E-mail
EMAIL_FLD_LEN = (
                        [
                            {'INPUT': 'i@f.ru'},
                            {'INPUT': 'i@fo.ru'},
                            {'INPUT': 'ivanofffffivanofffffivanofffffivanofffffivanofffffivanofffff@info.com'},
                            {'INPUT': 'ivanofffffivanofffffivanofffffivanofffffivanofffffivanofffff@infoo.com'},
                            {'INPUT': 'ivanofffffivanofffff@infoo.com'}
                        ],
                        [
                            '6 symbols',
                            '7 symbols',
                            '69 symbols',
                            '70 symbols',
                            '30 symbols'
                         ]
                        )

EMAIL_FLD_SYMB = (
                        [
                            {'INPUT': 'eng@domain.ru'},
                            {'INPUT': '1234@domain.ru'},
                            {'INPUT': '12-34@domain.ru'},
                            {'INPUT': '12_34@domain.ru'}
                        ],
                        [
                            'eng symbols as username in email',
                            'digits as username in email',
                            'dash (-) in email',
                            'underlining (_) in email'
                         ]
                        )

EMAIL_FLD_SPACE_DELETE = (
                        [
                            {'INPUT': '  mail@mail.ru'},
                            {'INPUT': 'mail@mail.ru  '}
                        ],
                        [
                            'with left space',
                            'with right space'
                         ],
                        )

# Данные для поля "Учебное заведение"
EDU_INSTIT_FLD_LEN = (
                        [
                            {'INPUT': 'ин'},
                            {'INPUT': 'инс'},
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсит'},
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'},
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверсите'}
                        ],
                        [
                            '2 symbols',
                            '3 symbols',
                            '149 symbols',
                            '150 symbols',
                            '50 symbols'
                         ]
                        )

EDU_INSTIT_FLD_SYMB = (
                        [
                            {'INPUT': '12345'},
                            {'INPUT': 'Abcd'},
                            {'INPUT': 'Абвг'},
                            {'INPUT': '()№""'},
                            {'INPUT': 'с пробелом'},
                            {'INPUT': 'с-дефисом'}
                        ],
                        [
                            'digits',
                            'eng letters',
                            'rus letters',
                            'spec symbols',
                            'letters with space',
                            'letters with dash'
                         ],
                        )

# Данные для поля "Специальность"
SPECIAL_FLD_LEN = (
                        [
                            {'INPUT': 'ин'},
                            {'INPUT': 'инс'},
                            {'INPUT': 'СпециализаСпециализаСпециализаСпециализаСпециализ'},
                            {'INPUT': 'СпециализаСпециализаСпециализаСпециализаСпециализа'},
                            {'INPUT': 'СпециализаСпециализаСпециализа'}
                        ],
                        [
                            '2 symbols',
                            '3 symbols',
                            '49 symbols',
                            '50 symbols',
                            '30 symbols'
                         ]
                        )

SPECIAL_FLD_SYMB = (
                        [
                            {'INPUT': 'Abcd'},
                            {'INPUT': 'Абвг'},
                            {'INPUT': 'с пробелом'},
                            {'INPUT': 'с-дефисом'}
                        ],
                        [
                            'eng letters',
                            'rus letters',
                            'letters with space',
                            'letters with dash'
                         ],
                        )

# Данные для поля Год окончания (образования)
END_OF_EDUC_YEAR_FLD = (
                        [
                            {'INPUT': '1950'},
                            {'INPUT': '2001'},
                            {'INPUT': '2024'}
                        ],
                        [
                            '1950 lowest border of range',
                            '2001 midle of range',
                            '2024 highest border of range'
                         ],
                        )

# Данные для поля Организация (повыш квалификации врача)
QUAL_ORGANIZATION_FLD_LEN = (
                        [
                            {'INPUT': 'ин'},
                            {'INPUT': 'инс'},
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсит'},
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'},
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверсите'}
                        ],
                        [
                            '2 symbols',
                            '3 symbols',
                            '149 symbols',
                            '150 symbols',
                            '50 symbols'
                         ]
                        )

QUAL_ORGANIZATION_FLD_SYMB = (
                        [
                            {'INPUT': '12345'},
                            {'INPUT': 'Abcd'},
                            {'INPUT': 'Абвг'},
                            {'INPUT': '()№""'},
                            {'INPUT': 'с пробелом'},
                            {'INPUT': 'с-дефисом'}
                        ],
                        [
                            'digits',
                            'eng letters',
                            'rus letters',
                            'spec symbols',
                            'letters with space',
                            'letters with dash'
                         ],
                        )

QUAL_ORGANIZATION_FLD_TEXT_REGISTR = (
                        [
                            {'INPUT': 'УниВерситеТ'}
                        ],
                        [
                            'wright text registr field save'
                         ],
                        )

QUAL_ORGANIZ_FLD_SPACE_DELETE = (
                        [
                            {'INPUT': '  Универ'},
                            {'INPUT': 'Универ  '}
                        ],
                        [
                            'with left space',
                            'with right space'
                         ],
                        )

# Данные для поля "Название программы"
PROG_NAME_FLD_LEN = (
                        [
                            {'INPUT': 'ин'},
                            {'INPUT': 'инс'},
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсит'},
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'},
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверсите'}
                        ],
                        [
                            '2 symbols',
                            '3 symbols',
                            '149 symbols',
                            '150 symbols',
                            '50 symbols'
                         ]
                        )

PROG_NAME_FLD_SYMB = (
                        [
                            {'INPUT': '12345'},
                            {'INPUT': 'Abcd'},
                            {'INPUT': 'Абвг'},
                            {'INPUT': '()№""'},
                            {'INPUT': 'с пробелом'},
                            {'INPUT': 'с-дефисом'}
                        ],
                        [
                            'digits',
                            'eng letters',
                            'rus letters',
                            'spec symbols',
                            'letters with space',
                            'letters with dash'
                         ],
                        )

PROG_NAME_FLD_TEXT_REGISTR = (
                        [
                            {'INPUT': 'УниВерситеТ'}
                        ],
                        [
                            'wright text registr field save'
                         ],
                        )

PROG_NAME_FLD_SPACE_DELETE = (
                        [
                            {'INPUT': '  Универ'},
                            {'INPUT': 'Универ  '}
                        ],
                        [
                            'with left space',
                            'with right space'
                         ],
                        )

# Данные для поля Год окончания (повыш квалификации)
END_OF_QUAL_YEAR_FLD = (
                        [
                            {'INPUT': '1950'},
                            {'INPUT': '2001'},
                            {'INPUT': '2024'}
                        ],
                        [
                            '1950 lowest border of range',
                            '2001 midle of range',
                            '2024 highest border of range'
                         ],
                        )

# Данные для поля Организация (опыт работы)
JOB_ORG_FLD_LEN = (
                        [
                            {'INPUT': 'ин'},
                            {'INPUT': 'инс'},
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсит'},
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'},
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверсите'}
                        ],
                        [
                            '2 symbols',
                            '3 symbols',
                            '149 symbols',
                            '150 symbols',
                            '50 symbols'
                         ]
                        )

JOB_ORG_FLD_SYMB = (
                        [
                            {'INPUT': '12345'},
                            {'INPUT': 'Abcd'},
                            {'INPUT': 'Абвг'},
                            {'INPUT': '()№""'},
                            {'INPUT': 'с пробелом'},
                            {'INPUT': 'с-дефисом'}
                        ],
                        [
                            'digits',
                            'eng letters',
                            'rus letters',
                            'spec symbols',
                            'letters with space',
                            'letters with dash'
                         ],
                        )

JOB_ORG_FLD_TEXT_REGISTR = (
                        [
                            {'INPUT': 'УниВерситеТ'}
                        ],
                        [
                            'wright text registr field save'
                         ],
                        )

JOB_ORG_FLD_SPACE_DELETE = (
                        [
                            {'INPUT': '  Универ'},
                            {'INPUT': 'Универ  '}
                        ],
                        [
                            'with left space',
                            'with right space'
                         ],
                        )

# Данные для поля Должность (опыт работы)
POSITION_FLD_LEN = (
                        [
                            {'INPUT': 'Ст'},
                            {'INPUT': 'Сто'},
                            {'INPUT': 'СтоматологСтоматологСтоматологСтоматологСтоматоло'},
                            {'INPUT': 'СтоматологСтоматологСтоматологСтоматологСтоматолог'},
                            {'INPUT': 'СтоматологСтоматолог'}
                        ],
                        [
                            '2 symbols',
                            '3 symbols',
                            '49 symbols',
                            '50 symbols',
                            '20 symbols'
                         ]
                        )

POSITION_FLD_SYMB = (
                        [
                            {'INPUT': '12345'},
                            {'INPUT': 'Abcd'},
                            {'INPUT': 'Абвг'},
                            {'INPUT': '()№""'},
                            {'INPUT': 'с пробелом'},
                            {'INPUT': 'с-дефисом'}
                        ],
                        [
                            'digits',
                            'eng letters',
                            'rus letters',
                            'spec symbols',
                            'letters with space',
                            'letters with dash'
                         ],
                        )

POSITION_FLD_TEXT_REGISTR = (
                        [
                            {'INPUT': 'СтоМатолОг'}
                        ],
                        [
                            'wright text registr field save'
                         ],
                        )

POSITION_FLD_SPACE_DELETE = (
                        [
                            {'INPUT': '  Стоматолог'},
                            {'INPUT': 'Стоматолог  '}
                        ],
                        [
                            'with left space',
                            'with right space'
                         ],
                        )

# Данные для поля "Период работы - с"
JOB_START_DATE_FLD = (
                        [
                            {'INPUT': '01/1950'},
                            {'INPUT': '11/2001'},
                            {'INPUT': '02/2024'}
                        ],
                        [
                            '1950 lowest border of range',
                            '2001 midle of range',
                            '2024 highest border of range'
                         ],
                        )

# Данные для поля "Период работы - по"
JOB_END_DATE_FLD = (
                        [
                            {'INPUT': '01/1950'},
                            {'INPUT': '11/2001'},
                            {'INPUT': '02/2024'}
                        ],
                        [
                            '1950 lowest border of range',
                            '2001 midle of range',
                            '2024 highest border of range'
                         ],
                        )

# Данные для поля "Диагностика и лечение"
DIAGNOSTIC_FLD_LEN = (
                        [
                            {'INPUT': 'ин'},
                            {'INPUT': 'инс'},
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      },
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                             },

                        ],
                        [
                            '2 symbols',
                            '3 symbols',
                            '1600 symbols',
                            '2000 symbols'
                         ]
                        )

DIAGNOSTIC_FLD_SYMB = (
                        [
                            {'INPUT': '12345'},
                            {'INPUT': 'Abc'},
                            {'INPUT': 'Абв'},
                            {'INPUT': "-.,:;!?\|/{}[]'“`#&$%@^*()+_< >"},
                            {'INPUT': '阪市立学鎰命'},
                            {'INPUT': 'ﷵ ﷵ ﷵ ﷵ'}
                        ],
                        [
                            'digits',
                            'eng letters',
                            'rus letters',
                            'not letters with space',
                            'hieroglyphs',
                            'arabic'
                         ],
                        )

DIAGNOSTIC_FLD_TEXT_REGISTR = (
                        [
                            {'INPUT': 'ДиагНостиКа'}
                        ],
                        [
                            'wright text registr field save'
                         ],
                        )

DIAGNOSTIC_FLD_SPACE_DELETE = (
                        [
                            {'INPUT': '  Диагностика'},
                            {'INPUT': 'Диагностика  '}
                        ],
                        [
                            'with left space',
                            'with right space'
                         ],
                        )

# данные для поля "Стоимость консультации"
PRICE_FLD_LEN = (
                        [
                            {'INPUT': '1'},
                            {'INPUT': '10000'},
                            {'INPUT': '99999'}
                        ],
                        [
                            'min price',
                            'middle of range',
                            'max price'
                         ],
                        )