# Данные для негативных проверок

# Данные для полей Имя и Фамилия
ALLNAME_FLD_MIN_LEN = (
                        [
                            {'INPUT': 's'}
                        ],
                        [
                            '1 letter'
                        ]
                       )

ALLNAME_FLD_MAX_LEN = (
                        [
                            {'INPUT': 'ИвановскийИвановскийИвановскийИвановскийИвановскийN'},
                            {'INPUT': 'ИвановскийИвановскийИвановскийИвановскийИвановскийИвановский'}
                        ],
                        [
                            '51 letters',
                            '60 letters'
                        ]
                       )

# Данные для поля Дата рождения
DBIRTH_FLD_UNVALID = (
                        [
                            {'INPUT': '32/01/1981'},
                            {'INPUT': '55/04/2010'},
                            {'INPUT': '32/07/2009'},
                            {'INPUT': '05/13/2010'},
                            {'INPUT': '05/10/1929'},
                            {'INPUT': '05/10/2030'}

                        ],
                        [
                            'Unvalid day in january',
                            'Unvalid day in april',
                            'Unvalid day in july',
                            'Unvalid 13th mounth',
                            'Unvalid year less than 1930',
                            'Unvalid date from future'
                         ]
                        )

# Данные для поля E-mail
EMAIL_FLD_MIN_LEN = (
                        [
                            {'INPUT': 'i@f.r'}
                        ],
                        [
                            '5 symbols'
                         ]
                        )

EMAIL_FLD_MAX_LEN = (
                        [
                            {'INPUT': 'ivanofffffivanofffffivanofffffivanofffffivanofffffivanofffffi@infoo.com'},
                            {'INPUT': 'ivanofffffivanofffffivanofffffivanofffffivanofffffivanofffffivanofffff@infoo.com'}
                        ],
                        [
                            '71 symbols',
                            '80 symbols'
                         ]
                        )

EMAIL_FLD_MASK = (
                        [
                            {'INPUT': 'ivanov@ivanov@mail.ru'},
                            {'INPUT': 'ivanov@mail.r'},
                            {'INPUT': '@mail.com'},
                            {'INPUT': 'ivanov.mail.ru'},
                            {'INPUT': 'ivanov@.ru'},
                            {'INPUT': 'ivanov@mail'}
                        ],
                        [
                            'two ats(@) in email',
                            'one symbol in domain of highest level',
                            'no username before at(@) in enail',
                            'no at(@) in email',
                            'no second level damain after at(@) in email',
                            'no domain of highest level in email'
                         ]
                        )

# Данные для поля Учебное заведение
EDU_INSTIT_FLD_MIN_LEN = (
                        [
                            {'INPUT': 'И'}
                        ],
                        [
                            '1 symbol'
                         ],
                        )

EDU_INSTIT_FLD_MAX_LEN = (
                        [
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситет'},
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'Университе'},
                        ],
                        [
                            '151 symbols',
                            '160 symbols'
                         ],
                        )

EDU_INSTIT_FLD_SYMB = (
                        [
                            {'INPUT': ".,:;!?\|/{}[]'`#&$%@^*+_< >"}
                        ],
                        [
                            'spec symbols'
                         ],
                        )

# Данные для поля Специальность (врача)
SPECIAL_FLD_MIN_LEN = (
                        [
                            {'INPUT': 'И'}
                        ],
                        [
                            '1 symbol'
                         ],
                        )

SPECIAL_FLD_MAX_LEN = (
                        [
                            {'INPUT': 'СпециализаСпециализаСпециализаСпециализаСпециализаС'},
                            {'INPUT': 'СпециализаСпециализаСпециализаСпециализаСпециализаСпециализа'},
                        ],
                        [
                            '51 symbols',
                            '60 symbols'
                         ],
                        )

SPECIAL_FLD_SYMB = (
                        [
                            {'INPUT': ".,:;!?\|/{}[]'“`#&$%@^*()+_< >"},
                            {'INPUT': '12345'}
                        ],
                        [
                            'spec symbols',
                            'digits'
                         ],
                        )

# Данные для поля Год окончания (образования врача)
END_OF_EDUC_LEN_LESS_THEN_FOUR_DGT = (
                        [
                            {'INPUT': '1'},
                            {'INPUT': '19'},
                            {'INPUT': '202'}
                        ],
                        [
                            'One digit',
                            'Two digits',
                            'Three digits'
                         ],
                        )

END_OF_EDUC_LEN_MORE_THEN_FOUR_DGT = (
                        [
                            {'INPUT': '19823'}
                        ],
                        [
                            'Five digit'
                         ],
                        )

END_OF_EDUC_CANT_INPUT = (
                        [
                            {'INPUT': 'engl'},
                            {'INPUT': 'русс'},
                            {'INPUT': '-.,:'},
                            {'INPUT': '    '}
                        ],
                        [
                            'english letters',
                            'russian letters',
                            'service symbols',
                            'spaces'
                         ],
                        )

END_OF_EDUC_1950 = (
                        [
                            {'INPUT': '1949'}
                        ],
                        [
                            '1949'
                         ],
                        )

# Данные для поля Организация (повышения квалификации врача)
QUAL_ORGANIZ_FLD_MIN_LEN = (
                        [
                            {'INPUT': 'И'}
                        ],
                        [
                            '1 symbol'
                         ],
                        )

QUAL_ORGANIZ_FLD_MAX_LEN = (
                        [
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситет'},
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'Университе'},
                        ],
                        [
                            '151 symbols',
                            '160 symbols'
                         ],
                        )

QUAL_ORGANIZ_FLD_SYMB = (
                        [
                            {'INPUT': ".,:;!?\|/{}[]'`#&$%@^*+_< >"}
                        ],
                        [
                            'spec symbols'
                         ],
                        )

# Данные для поля Название программы
PROG_NAME_FLD_MIN_LEN = (
                        [
                            {'INPUT': 'И'}
                        ],
                        [
                            '1 symbol'
                         ],
                        )

PROG_NAME_FLD_MAX_LEN = (
                        [
                            {'INPUT': 'СпециализаСпециализаСпециализаСпециализаСпециализаСпециализаСпециализаСпециализа'
                                      'СпециализаСпециализаСпециализаСпециализаСпециализаСпециализаСпециализаС'},
                            {'INPUT': 'СпециализаСпециализаСпециализаСпециализаСпециализаСпециализаСпециализаСпециализа'
                                      'СпециализаСпециализаСпециализаСпециализаСпециализаСпециализаСпециализа'
                                      'Специализа'},
                        ],
                        [
                            '151 symbols',
                            '160 symbols'
                         ],
                        )

PROG_NAME_FLD_SYMB = (
                        [
                            {'INPUT': ".,:;!?\|/{}[]'“`#&$%@^*()+_< >"}
                        ],
                        [
                            'spec symbols'
                         ],
                        )

# Данные для поля Год окончания (повыш квалификации врача)
END_OF_QUAL_LEN_LESS_THEN_FOUR_DGT = (
                        [
                            {'INPUT': '1'},
                            {'INPUT': '19'},
                            {'INPUT': '202'}
                        ],
                        [
                            'One digit',
                            'Two digits',
                            'Three digits'
                         ],
                        )

END_OF_QUAL_LEN_MORE_THEN_FOUR_DGT = (
                        [
                            {'INPUT': '19823'}
                        ],
                        [
                            'Five digit'
                         ],
                        )

END_OF_QUAL_CANT_INPUT = (
                        [
                            {'INPUT': 'engl'},
                            {'INPUT': 'русс'},
                            {'INPUT': '-.,:'},
                            {'INPUT': '    '}
                        ],
                        [
                            'english letters',
                            'russian letters',
                            'service symbols',
                            'spaces'
                         ],
                        )

END_OF_QUAL_1950 = (
                        [
                            {'INPUT': '1949'}
                        ],
                        [
                            '1949'
                         ],
                        )

# Данные для поля Организация (опыт работы врача)
JOB_ORG_FLD_MIN_LEN = (
                        [
                            {'INPUT': 'И'}
                        ],
                        [
                            '1 symbol'
                         ],
                        )

JOB_ORG_FLD_MAX_LEN = (
                        [
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситет'},
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'Университе'},
                        ],
                        [
                            '151 symbols',
                            '160 symbols'
                         ],
                        )

JOB_ORG_FLD_SYMB = (
                        [
                            {'INPUT': ".,:;!?\|/{}[]'`#&$%@^*+_< >"}
                        ],
                        [
                            'spec symbols'
                         ],
                        )

# Данные для поля Должность (опыт работы врача)
POSITION_FLD_MIN_LEN = (
                        [
                            {'INPUT': 'И'}
                        ],
                        [
                            '1 symbol'
                         ],
                        )

POSITION_FLD_MAX_LEN = (
                        [
                            {'INPUT': 'СтоматологСтоматологСтоматологСтоматологСтоматологС'},
                            {'INPUT': 'СтоматологСтоматологСтоматологСтоматологСтоматологСтоматолог'},
                        ],
                        [
                            '51 symbols',
                            '60 symbols'
                         ],
                        )

POSITION_FLD_SYMB = (
                        [
                            {'INPUT': ".,:;!?\|/{}[]'`#&$%@^*+_< >"}
                        ],
                        [
                            'spec symbols'
                         ],
                        )

# Данные для поля "Период работы - с"
JOB_START_DATE_LEN_LESS_THEN_SIX_DGT = (
                        [
                            {'INPUT': '1'},
                            {'INPUT': '19/'},
                            {'INPUT': '19/1'},
                            {'INPUT': '19/19'},
                            {'INPUT': '19/198'}
                        ],
                        [
                            'One digit',
                            'Two digits',
                            'Three digits',
                            'Four digits',
                            'Five digits'
                         ],
                        )

JOB_START_DATE_UNVALID = (
                        [
                            {'INPUT': '00/1981'},
                            {'INPUT': '13/2010'},
                            {'INPUT': '02/2025'},

                        ],
                        [
                            '00 month',
                            '13 month',
                            'Date in future'
                         ]
                        )

JOB_START_LESS_1950_UNVALID = (
                        [
                            {'INPUT': '12/1949'},
                            {'INPUT': '05/1933'},

                        ],
                        [
                            'earlier then 1950 - 1949',
                            'earlier then 1950 - 1933'
                         ]
                        )

JOB_START_CANT_INPUT = (
                        [
                            {'INPUT': 'engl'},
                            {'INPUT': 'русс'},
                            {'INPUT': '-.,:='},
                            {'INPUT': '    '}
                        ],
                        [
                            'english letters',
                            'russian letters',
                            'service symbols',
                            'spaces'
                         ],
                        )

JOB_STRT_MORE_THEN_SIX_DGT = (
                        [
                            {'INPUT': '12/19777'}
                        ],
                        [
                            'Seven digits'
                         ],
                        )

# Данные для поля "Период работы - по"
JOB_END_DATE_LEN_LESS_THEN_SIX_DGT = (
                        [
                            {'INPUT': '1'},
                            {'INPUT': '19/'},
                            {'INPUT': '19/1'},
                            {'INPUT': '19/19'},
                            {'INPUT': '19/198'}
                        ],
                        [
                            'One digit',
                            'Two digits',
                            'Three digits',
                            'Four digits',
                            'Five digits'
                         ],
                        )

JOB_END_DATE_UNVALID = (
                        [
                            {'INPUT': '00/1981'},
                            {'INPUT': '13/2010'},
                            {'INPUT': '02/2025'},

                        ],
                        [
                            '00 month',
                            '13 month',
                            'Date in future'
                         ]
                        )

JOB_END_LESS_1950_UNVALID = (
                        [
                            {'INPUT': '12/1949'},
                            {'INPUT': '05/1933'},

                        ],
                        [
                            'earlier then 1950 - 1949',
                            'earlier then 1950 - 1933'
                         ]
                        )

JOB_END_CANT_INPUT = (
                        [
                            {'INPUT': 'engl'},
                            {'INPUT': 'русс'},
                            {'INPUT': '-.,:='},
                            {'INPUT': '    '}
                        ],
                        [
                            'english letters',
                            'russian letters',
                            'service symbols',
                            'spaces'
                         ],
                        )

JOB_END_MORE_THEN_SIX_DGT = (
                        [
                            {'INPUT': '12/19777'}
                        ],
                        [
                            'Seven digits'
                         ],
                        )

# Данные для поля Название программы
DIAGNOSTIC_FLD_MIN_LEN = (
                        [
                            {'INPUT': 'И'}
                        ],
                        [
                            '1 symbol'
                         ],
                        )

DIAGNOSTIC_FLD_MAX_LEN = (
                        [
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'У'},
                            {'INPUT': 'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверситеУниверсите'
                                      'УниверситеУниверситеУниверситеУниверситеУниверсите'},
                        ],
                        [
                            '2001 symbols',
                            '2500 symbols'
                         ],
                        )

# данные для поля "Стоимость консультации"
PRICE_FLD_ZERO = (
                        [
                            {'INPUT': '0'},
                        ],
                        [
                            'zero',
                         ],
                        )

PRICE_FLD_LESS_THEN_ZERO = (
                        [
                            {'INPUT': '-1000'},
                        ],
                        [
                            'less then zero',
                         ],
                        )

PRICE_FLD_MAX_LEN = (
                        [
                            {'INPUT': '100000'},
                            {'INPUT': '150500'}
                        ],
                        [
                            'more then 99999',
                            'more then 99999'
                         ],
                        )

PRICE_FLD_NOT_DGTS = (
                        [
                            {'INPUT': 'abc'},
                            {'INPUT': '_+!@#&'}
                        ],
                        [
                            'letters',
                            'serv symbols'
                         ],
                        )
