ALLNAME_FLD_MIN_LEN = (
                        [
                            {'INPUT': 's'}
                        ],
                        [
                            '1 letter'
                        ]
                       )

ALLNAME_FLD_MAX_LEN = (
                        [
                            {'INPUT': 'ИвановскийИвановскийИвановскийИвановскийИвановскийN'},
                            {'INPUT': 'ИвановскийИвановскийИвановскийИвановскийИвановскийИвановский'}
                        ],
                        [
                            '51 letters',
                            '60 letters'
                        ]
                       )